# Bài 2 - Hoàn thành notebook sau

### Bước 1.Import các thư viện cần thiết

In [1]:
import pandas as pd
import io
import requests

### Bước 2. Đọc file từ url sau đó lưu vào biến user

In [19]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
s=requests.get(url).content
dataframe=pd.read_csv(io.StringIO(s.decode('utf-8')), sep='|')
print(dataframe)

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Bước 3. In 25 dòng đầu tiên

In [4]:
dataframe.head(25)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

### Bước 4. In 10 dòng cuối

In [5]:
dataframe.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Bước 5. Data này có bao nhiêu dòng

In [7]:
dataframe.shape[0]

943

### Bước 6. Có bao nhiêu cột, bao gồm những cột nào

In [12]:
print(dataframe.shape[1])
list(dataframe.columns)

5

['user_id', 'age', 'gender', 'occupation', 'zip_code']

### Bước 7. Kiểu dữ liệu của mỗi columns?

In [13]:
dataframe.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Bước 8. In giá trị của cột occupation

In [14]:
dataframe["occupation"]

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### Bước  9. Có bao nhiêu giá trị khác nhau trong cột occupation

In [16]:
dataframe["occupation"].drop_duplicates().shape[0]

21

### Bước 10.Tính độ tuổi trung bình

In [24]:
dataframe.agg("mean")["age"]

34.05196182396607

### Bước 11: Tính độ tuổi trung bình theo occupation

In [25]:
dataframe.groupby(["occupation"]).mean()

                  user_id        age
occupation
administrator  430.949367  38.746835
artist         451.892857  31.392857
doctor         533.714286  43.571429
educator       466.905263  42.010526
engineer       456.328358  36.388060
entertainment  398.000000  29.222222
executive      422.312500  38.718750
healthcare     501.437500  41.562500
homemaker      443.000000  32.571429
lawyer         359.083333  36.750000
librarian      486.588235  40.000000
marketing      437.807692  37.615385
none           368.666667  26.555556
other          542.733333  34.523810
programmer     435.530303  33.121212
retired        515.714286  63.071429
salesman       494.916667  35.666667
scientist      465.129032  35.548387
student        484.954082  22.081633
technician     497.629630  33.148148
writer         495.711111  36.311111

### Bước 12: Với mỗi occupation tình độ tuổi lớn nhất và nhỏ nhất

In [35]:
dataframe.groupby(["occupation"])["age"].agg(["min", "max"])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60